export const SKILL_ICONS = [
  'typescript',
  'react',
  'svelte',
  'nestjs',
  'vite',
  'vitest',
  'nodejs',
  'openapi',
  'docker',
  'github',
  'elixir',
  'c'
] as const;

export const WARNING_TEXTS: string[] = ['⚠️警告⚠️', '☠️あなたのブラウザはハッキングされました☠️'];

export const PROFILE_TEXTS: string[] = [
  'すみません、嘘です。',
  '文章の冒頭に強烈な一文があると、その後の文章を読み続けてくれるというライフハックを最近知ったので使ってみたくなっただけです。',
  'それにしても、はるばるこんなサイトにアクセスしていただきありがとうございます🙇‍♂️',
  'About Meということで簡単な自己紹介でも🍵',
  '中学生の頃、みんな持っていた携帯電話を買ってもらえず、代わりに渡されたのがノートPCでした。',
  'そこからITエンジニアへの道が始まっていたのではないかと、今思い返せばそんな気がしています。(父親がSEだったのも影響ありそうだけど)',
  '新卒で入社した会社は大手SIerで組込み開発をしていましたが、C言語の難易度の高さに挫折。。。',
  'その後、動画制作に進んだり紆余曲折した結果、Web開発をすることになっていました🤔(貯金無くなってUberEatsでなんとかしていた時期もあったり)',
  'こんな感じでまだまだ書きたいこと色々あるんですけど、そろそろ飽きてくる頃だと思うのでこの辺で終わりとしたいと思います。',
  '最後まで読んでいただき、ありがとうございました！(PS.当サイトに関するこだわりは<a href="/concept">Concept</a>に書いてあるので、暇だったら見てください)'
];
